rapport-chs-mobile/backend/views/engineer/index.php

            //'id',
            'name',
            //'company_type_id',
            [
                'attribute' =>'company_type_id',
                'filter' =>ArrayHelper::map(Companytype::find()->all(), 'id', 'company_type'),
                'value' => function ($data) {
                    return $data->companytype->company_type;
                },
            ],
---
SELECT * FROM `fme_company_type` WHERE `id`=1
SELECT * FROM `fme_company_type`