rapport-chs-mobile/frontend/views/customer/editcustomeronly.php

SELECT * FROM `customer` WHERE `id`=4360
---

?>

<?php $customer_model=Customer::findOne($customer_id);?>