rapport-chs-mobile/common/models/Documentsmanuals.php

SELECT * FROM `servicecalls_docs_manuals` WHERE `servicecall_id`=5703
---
    public static function loadalldocumentsbyservicecallid($service_id)
    {
        return Servicecallsdocsmanuals::findAll(['servicecall_id'=>$service_id]);

SELECT * FROM `servicecalls_docs_manuals` WHERE `servicecall_id`=4627
---
    public static function loadallallsignaturesforservicecallid($service_id)
    {
        $alldocs=Servicecallsdocsmanuals::findAll(['servicecall_id'=>$service_id]);