rapport-chs-mobile/common/models/Documenttype.php

SELECT * FROM `document_type` WHERE `category`='IMAGE'
---
    public static function getdocumenttypeslist($category=null)
    {
        if ($category)
            $items = Documenttype::find()->where(['category'=>$category])->all();