rapport-chs-mobile/common/models/EnggdiarySearch.php

    public function appointmentsfordateforengineer($engineer_id, $date)
    {

        $date_start_int=strtotime($date.'00:00:00 ');
        $date_end_int=strtotime($date.'23:59:00 ');

        return Enggdiary::find()
            ->where(['between', 'visit_start_date', $date_start_int, $date_end_int])
            ->andWhere(['engineer_id'=> $engineer_id])
            ->andWhere(['status'=> '3'])
---
SELECT * FROM `enggdiary` WHERE ((`visit_start_date` BETWEEN 1484438400 AND 1484524740) AND (`engineer_id`=90000001)) AND (`status`='3') ORDER BY `visit_start_date`