rapport-chs-mobile/common/models/Enggdiary.php

    public static function loadallappointmentsbyservicecall_id($service_id)
    {
        return self::findAll(['servicecall_id'=>$service_id]);
---
SELECT * FROM `enggdiary` WHERE `servicecall_id`=1