rapport-chs-mobile/common/models/Handyfunctions.php

    public static function get_all_brands_for_drop_down()
    {
        return ArrayHelper::map(Brand::find()->orderBy(['name'=>SORT_ASC])->all(), 'id', 'name');
---
SELECT * FROM `brand` ORDER BY `name`

    public static function get_all_product_types_for_drop_down()
    {
        return ArrayHelper::map(Producttype::find()->orderBy(['name'=>SORT_ASC])->all(), 'id', 'name');
---
SELECT * FROM `product_type` ORDER BY `name`