rapport-chs-mobile/common/models/Jobstatus.php

SELECT * FROM `job_status` WHERE `mobile_display`='1'
---
    public static function listformobiledropdown()
    {

        $items=self::find()->where(['mobile_display'=>'1'])->all();