rapport-chs-mobile/common/models/PostcodesQuery.php

SELECT * FROM `fme_postcodes`
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM `fme_postcodes` WHERE `postcode_id`=1204
---
    public function one($db = null)
    {
        return parent::one($db);