rapport-chs-mobile/common/models/ProducttypeQuery.php

SELECT * FROM `fme_product_type` WHERE `product_id`=14
---
    public function one($db = null)
    {
        return parent::one($db);