rapport-chs-mobile/common/models/Servicecall.php

    public static function update_activitylog($servicecall_id)
    {

        $model=Servicecall::findOne($servicecall_id);
---
SELECT * FROM `servicecall` WHERE `id`='4593'

    public static function update_jobstatus($job_status_id, $servicecall_id)
    {

    	$status_update=Servicecall::updateAll(['job_status_id' => $job_status_id],['id'=>$servicecall_id]);
---
UPDATE `servicecall` SET `job_status_id`=23 WHERE `id`='4593'