rapport-chs-mobile/common/models/Setup.php

    public static function loadmycompanydetails()
    {
        return self::findOne('1');
---
SELECT * FROM `setup` WHERE `id`='1'