rapport-chs-mobile/common/models/Sparesused.php

    public static function loadallsparesbyservicecallid($service_id)
    {
        return self::findAll(['servicecall_id'=>$service_id]);
---
SELECT * FROM `spares_used` WHERE `servicecall_id`=5703

    public function beforeSave($insert)
    {



      if ($this->master_item_id==0)
      {
        $master_db_item=new Masteritems();
        ////Insert record in master Item dataabse
        $master_db_item->part_number=$this->part_number;
        $master_db_item->name=$this->item_name;
        $master_db_item->active='1';
        $master_db_item->created=time();
      }
      else {
          ///Just update price in master item database
          $master_db_item=Masteritems::findOne($this->master_item_id);
      }

      $master_db_item->sale_price=$this->unit_price;

      if ($master_db_item->save())
---
INSERT INTO `master_items` (`part_number`, `name`, `active`, `created`, `sale_price`) VALUES ('760570401', 'Bushes', 1, '1479307052', 0)

      public function updatesparestotalinservicecall()
      {



            $allspares=Sparesused::loadallsparesbyservicecallid($this->servicecall_id);

            $total_spares_cost=0;
            foreach ($allspares as $s)
            {
              //echo "<br>".$s->item_name;
              //echo " --total_price : ".$s->total_price;
              $total_spares_cost=$total_spares_cost+$s->total_price;
            }

            //echo '<br>'.$total_spares_cost;


            $vat_percentage = Yii::$app->params['vat_percentage'];

            $vat_on_total=$total_spares_cost*$vat_percentage/100;

            $net_cost=$vat_on_total+$total_spares_cost;

            /*
            $total_spares_cost=Yii::$app->formatter->asCurrency($total_spares_cost);
            $vat_on_total=Yii::$app->formatter->asCurrency($vat_on_total,'');
            $net_cost=Yii::$app->formatter->asCurrency($net_cost);
            */

        	return Servicecall::updateAll([
                'total_cost'=>$total_spares_cost,
                'vat_on_total'=>$vat_on_total,
                'net_cost'=>$net_cost,
                ],
                ///WHERE
                ['id'=>$this->servicecall_id]
            );
---
UPDATE `servicecall` SET `total_cost`=0, `vat_on_total`=0, `net_cost`=0 WHERE `id`=4908