rapport-chs-mobile/common/models/User.php

SELECT * FROM `fme_users` WHERE (`id`=51) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `fme_users` WHERE (`email`='sudeep.makku@gmail.com') AND (`status`=10)
---
    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);