rapport-chs-mobile/frontend/views/product/editproductonly.php


?>

<?php $product_model=Product::findOne($product_id);?>
---
SELECT * FROM `product` WHERE `id`=4689