rapport-chs-mobile/frontend/controllers/DocumentsmanualsController.php

INSERT INTO `servicecalls_docs_manuals` (`servicecall_id`, `document_id`) VALUES (4779, 64)
---
    public function actionQuickupload()
    {
        $model = new Documentsmanuals();
        $enggdiary_id= Yii::$app->getRequest()->get('enggdiary_id');
        $servicecall_id = Yii::$app->getRequest()->get('servicecall_id');


        if (Yii::$app->request->isPost && $servicecall_id) {

            $model->load(Yii::$app->request->post());
            $model->uploadfile = UploadedFile::getInstance($model, 'uploadfile');


            if ($model->save()) {
                // file is uploaded successfully

                if ($model->upload()) {
                    $service_doc = new Servicecallsdocsmanuals();
                    $service_doc->servicecall_id = $servicecall_id;
                    $service_doc->document_id = $model->id;
                    if ($service_doc->save()) {