rapport-chs-mobile/frontend/controllers/EnggdiaryController.php

    public function actionViewappointment()
    {

        $servicecall_id = Yii::$app->request->get('servicecall_id');
        $enggdiary_id = Yii::$app->request->get('enggdiary_id');

        $engineer_id = Yii::$app->user->identity->engineer_id;


        if (!$servicecall_id || !$engineer_id || !$enggdiary_id )
        {
            return $this->redirect(['/site']);
        }
        else{
            $engg_currently_working_job_status_id='23';//Engineer Working on the call
            $status_update=Servicecall::update_jobstatus($engg_currently_working_job_status_id, $servicecall_id);


            if ($status_update)
            {
                $servicecall=Servicecall::findOne($servicecall_id);
---
SELECT * FROM `servicecall` WHERE `id`='5703'

    public function actionUpdatedurationofappointment()
    {
        //$duration_in_seconds=Yii::$app->request->post('duration_in_seconds');
        //$enggdiary_id=Yii::$app->request->post('enggdiary_id');

		$duration_in_seconds=Yii::$app->request->get('duration_in_seconds');
        $enggdiary_id=Yii::$app->request->get('enggdiary_id');


        if ($duration_in_seconds && $enggdiary_id)
        {
            ///converting miliseconds to sec
            $duration_in_seconds = intval($duration_in_seconds/1000);



            $model=$this->findModel($enggdiary_id);
            $model->duration_of_call=$model->duration_of_call+$duration_in_seconds;

            if ($model->save())
---
UPDATE `enggdiary` SET `duration_of_call`=7805 WHERE `id`=7483

    protected function findModel($id)
    {
        if (($model = Enggdiary::findOne($id)) !== null) {
---
SELECT * FROM `enggdiary` WHERE `id`='8298'