rapport-chs-mobile/frontend/controllers/EnggdiaryController.php

UPDATE `enggdiary` SET `duration_of_call`=3663 WHERE `id`=7050
---
    public function actionUpdatedurationofappointment()
    {
        $duration_in_seconds=Yii::$app->request->post('duration_in_seconds');
        $enggdiary_id=Yii::$app->request->post('enggdiary_id');


        if ($duration_in_seconds && $enggdiary_id)
        {
            ///converting miliseconds to sec
            $duration_in_seconds = intval($duration_in_seconds/1000);


            $model=$this->findModel($enggdiary_id);
            $model->duration_of_call=$model->duration_of_call+$duration_in_seconds;
            if ($model->save())

SELECT * FROM `enggdiary` WHERE `id`='7050'
---
    protected function findModel($id)
    {
        if (($model = Enggdiary::findOne($id)) !== null) {