rapport-chs-mobile/frontend/controllers/ServicecallController.php

SELECT * FROM `servicecall` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Servicecall::findOne($id)) !== null) {