rapport-chs-mobile/frontend/controllers/SparesusedController.php

SELECT * FROM `spares_used` WHERE `id`='11814'
---
    protected function findModel($id)
    {
        if (($model = Sparesused::findOne($id)) !== null) {